<%--
  Created by IntelliJ IDEA.
  User: ZeDongW
  Date: 2020/4/28 0028
  Time: 11:18
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <title>获取时间</title>
    <script type="text/javascript" src="js/getAjax.js"></script>
</head>
<body>
当前时间：<span id="showTime"></span><br>
    <input type="button" value="获取当前时间" id="getTime">
    <p>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
    </p>
    <script type="text/javascript">
        //获取提交标签
        let inputElement = document.getElementById("getTime");
        inputElement.onclick = function () {
            let ajax = getAjax();
            let method = "Post";
            let url = "${pageContext.request.contextPath}/AjaxTimeServlet?time=" + new Date().getTime();
            ajax.open(method, url);
            ajax.send();
            ajax.onreadystatechange = function () {
                if (ajax.readyState == 4){
                    if (ajax.status == 200){
                        const nowTime = ajax.responseText;
                        let spanElement = document.getElementById("showTime");
                        spanElement.innerHTML = nowTime;
                    }
                }
            }
        }
    </script>
</body>
</html>
