<%--
  Created by IntelliJ IDEA.
  User: ZeDongW
  Date: 2020/4/28 0028
  Time: 11:18
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <title>获取时间</title>
</head>
<body>
    当前时间：${nowTime}<br>
    <input type="button" value="获取当前时间">
    <p>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
        静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本静态文本<br>
    </p>
    <script type="text/javascript">
        let inputElement = document.getElementsByTagName("input")[0];
        inputElement.onclick = function () {
            let url = "${pageContext.request.contextPath}/TimeServlet";
            window.location.href = url;
        }
    </script>
</body>
</html>
